02_benchmark_fio/executed.Gottfried.20140801_202540.18486/fio.job.hioa1.btrfs.libaio.randwrite.bs2k.j32.depth2.txt
06-08 18:17:35 1407316655
job.hioa1.btrfs.libaio.randwrite.bs2k.j32.depth2: (g=0): rw=randwrite, bs=2K-2K/2K-2K/2K-2K, ioengine=libaio, iodepth=2
...
job.hioa1.btrfs.libaio.randwrite.bs2k.j32.depth2: (g=0): rw=randwrite, bs=2K-2K/2K-2K/2K-2K, ioengine=libaio, iodepth=2
fio-2.0.14
Starting 32 processes

job.hioa1.btrfs.libaio.randwrite.bs2k.j32.depth2: (groupid=0, jobs=32): err= 0: pid=951: Wed Aug  6 18:21:35 2014
  write: io=2509.4MB, bw=10706KB/s, iops=5353 , runt=240006msec
    slat (usec): min=165 , max=41016 , avg=5974.17, stdev=693.85
    clat (usec): min=2 , max=41023 , avg=5978.66, stdev=694.35
     lat (usec): min=358 , max=54325 , avg=11953.42, stdev=1076.31
    clat percentiles (usec):
     |  1.00th=[ 5600],  5.00th=[ 5664], 10.00th=[ 5664], 20.00th=[ 5728],
     | 30.00th=[ 5728], 40.00th=[ 5792], 50.00th=[ 5792], 60.00th=[ 5856],
     | 70.00th=[ 5920], 80.00th=[ 5984], 90.00th=[ 6432], 95.00th=[ 7200],
     | 99.00th=[ 8096], 99.50th=[ 8896], 99.90th=[11456], 99.95th=[14400],
     | 99.99th=[35072]
    bw (KB/s)  : min=  281, max=  481, per=3.12%, avg=334.44, stdev= 7.23
    lat (usec) : 4=0.01%, 250=0.03%, 500=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=99.77%, 20=0.18%, 50=0.02%
  cpu          : usr=0.07%, sys=0.87%, ctx=3879905, majf=0, minf=763
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1284774/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=2509.4MB, aggrb=10706KB/s, minb=10706KB/s, maxb=10706KB/s, mint=240006msec, maxt=240006msec
06-08 18:21:35 1407316895