02_benchmark_fio/executed.Gottfried.20140801_202540.18486/fio.job.hioa1.btrfs.libaio.randwrite.bs8k.j2.depth32.txt
06-08 19:52:26 1407322346
job.hioa1.btrfs.libaio.randwrite.bs8k.j2.depth32: (g=0): rw=randwrite, bs=8K-8K/8K-8K/8K-8K, ioengine=libaio, iodepth=32
job.hioa1.btrfs.libaio.randwrite.bs8k.j2.depth32: (g=0): rw=randwrite, bs=8K-8K/8K-8K/8K-8K, ioengine=libaio, iodepth=32
fio-2.0.14
Starting 2 processes

job.hioa1.btrfs.libaio.randwrite.bs8k.j2.depth32: (groupid=0, jobs=2): err= 0: pid=2136: Wed Aug  6 19:52:33 2014
  write: io=2048.0MB, bw=337109KB/s, iops=42138 , runt=  6221msec
    slat (usec): min=22 , max=9599 , avg=44.73, stdev=166.80
    clat (usec): min=15 , max=10674 , avg=1456.84, stdev=930.24
     lat (usec): min=40 , max=10711 , avg=1501.78, stdev=945.57
    clat percentiles (usec):
     |  1.00th=[ 1012],  5.00th=[ 1048], 10.00th=[ 1064], 20.00th=[ 1096],
     | 30.00th=[ 1128], 40.00th=[ 1144], 50.00th=[ 1160], 60.00th=[ 1176],
     | 70.00th=[ 1208], 80.00th=[ 1432], 90.00th=[ 2064], 95.00th=[ 3184],
     | 99.00th=[ 5920], 99.50th=[ 7392], 99.90th=[ 9664], 99.95th=[10048],
     | 99.99th=[10688]
    bw (KB/s)  : min=113033, max=226464, per=50.38%, avg=169849.58, stdev=33911.83
    lat (usec) : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
    lat (usec) : 750=0.01%, 1000=0.75%
    lat (msec) : 2=88.73%, 4=7.32%, 10=3.14%, 20=0.06%
  cpu          : usr=5.12%, sys=71.96%, ctx=50893, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=2048.0MB, aggrb=337108KB/s, minb=337108KB/s, maxb=337108KB/s, mint=6221msec, maxt=6221msec
06-08 19:52:33 1407322353