02_benchmark_fio/executed.Gottfried.20140801_202540.18486/fio.job.hioa1.btrfs.libaio.read.bs2k.j1.depth8.txt
06-08 09:47:15 1407286035
job.hioa1.btrfs.libaio.read.bs2k.j1.depth8: (g=0): rw=read, bs=2K-2K/2K-2K/2K-2K, ioengine=libaio, iodepth=8
fio-2.0.14
Starting 1 process

job.hioa1.btrfs.libaio.read.bs2k.j1.depth8: (groupid=0, jobs=1): err= 0: pid=25764: Wed Aug  6 09:47:17 2014
  read : io=1024.0MB, bw=914190KB/s, iops=457095 , runt=  1147msec
    slat (usec): min=1 , max=11 , avg= 1.31, stdev= 0.47
    clat (usec): min=2 , max=32 , avg=15.70, stdev= 0.57
     lat (usec): min=3 , max=38 , avg=17.07, stdev= 0.54
    clat percentiles (usec):
     |  1.00th=[   15],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   15], 40.00th=[   16], 50.00th=[   16], 60.00th=[   16],
     | 70.00th=[   16], 80.00th=[   16], 90.00th=[   16], 95.00th=[   16],
     | 99.00th=[   17], 99.50th=[   17], 99.90th=[   22], 99.95th=[   23],
     | 99.99th=[   24]
    bw (KB/s)  : min=914144, max=914216, per=100.00%, avg=914180.00, stdev=50.91
    lat (usec) : 4=0.01%, 10=0.01%, 20=99.84%, 50=0.16%
  cpu          : usr=34.90%, sys=64.57%, ctx=0, majf=0, minf=27
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=524288/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=1024.0MB, aggrb=914190KB/s, minb=914190KB/s, maxb=914190KB/s, mint=1147msec, maxt=1147msec
06-08 09:47:17 1407286037