02_benchmark_fio/executed.Gottfried.20140801_202540.18486/fio.job.hioa1.xfs.libaio.randwrite.bs2k.j16.depth4.txt
02-08 02:35:17 1406914517
job.hioa1.xfs.libaio.randwrite.bs2k.j16.depth4: (g=0): rw=randwrite, bs=2K-2K/2K-2K/2K-2K, ioengine=libaio, iodepth=4
...
job.hioa1.xfs.libaio.randwrite.bs2k.j16.depth4: (g=0): rw=randwrite, bs=2K-2K/2K-2K/2K-2K, ioengine=libaio, iodepth=4
fio-2.0.14
Starting 16 processes

job.hioa1.xfs.libaio.randwrite.bs2k.j16.depth4: (groupid=0, jobs=16): err= 0: pid=25980: Sat Aug  2 02:39:17 2014
  write: io=3936.6MB, bw=16796KB/s, iops=8397 , runt=240003msec
    slat (usec): min=8 , max=10284 , avg=1902.71, stdev=399.95
    clat (usec): min=66 , max=14367 , avg=5716.37, stdev=685.85
     lat (usec): min=88 , max=17197 , avg=7619.55, stdev=788.24
    clat percentiles (usec):
     |  1.00th=[ 5152],  5.00th=[ 5216], 10.00th=[ 5280], 20.00th=[ 5280],
     | 30.00th=[ 5344], 40.00th=[ 5344], 50.00th=[ 5408], 60.00th=[ 5472],
     | 70.00th=[ 5664], 80.00th=[ 6112], 90.00th=[ 6816], 95.00th=[ 7200],
     | 99.00th=[ 8032], 99.50th=[ 8512], 99.90th=[ 9408], 99.95th=[10176],
     | 99.99th=[13120]
    bw (KB/s)  : min= 1008, max= 1104, per=6.25%, avg=1050.18, stdev= 9.63
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=99.93%, 20=0.06%
  cpu          : usr=0.19%, sys=0.47%, ctx=4031160, majf=0, minf=406
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2015511/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=3936.6MB, aggrb=16795KB/s, minb=16795KB/s, maxb=16795KB/s, mint=240003msec, maxt=240003msec

Disk stats (read/write):
  hioa: ios=0/2015412, merge=0/0, ticks=0/228480, in_queue=228570, util=95.24%
02-08 02:39:18 1406914758