02_benchmark_fio/executed.Gottfried.20140801_202540.18486/fio.job.hioa1.xfs.sync.randread.bs2k.j8.depth2.txt
02-08 13:58:05 1406955485
job.hioa1.xfs.sync.randread.bs2k.j8.depth2: (g=0): rw=randread, bs=2K-2K/2K-2K/2K-2K, ioengine=sync, iodepth=2
...
job.hioa1.xfs.sync.randread.bs2k.j8.depth2: (g=0): rw=randread, bs=2K-2K/2K-2K/2K-2K, ioengine=sync, iodepth=2
fio-2.0.14
Starting 8 processes

job.hioa1.xfs.sync.randread.bs2k.j8.depth2: (groupid=0, jobs=8): err= 0: pid=9215: Sat Aug  2 13:59:02 2014
  read : io=8192.0MB, bw=147916KB/s, iops=73957 , runt= 56712msec
    clat (usec): min=45 , max=559 , avg=106.68, stdev=17.93
     lat (usec): min=45 , max=559 , avg=106.77, stdev=17.93
    clat percentiles (usec):
     |  1.00th=[   90],  5.00th=[   92], 10.00th=[   92], 20.00th=[   94],
     | 30.00th=[   97], 40.00th=[  103], 50.00th=[  106], 60.00th=[  108],
     | 70.00th=[  109], 80.00th=[  117], 90.00th=[  120], 95.00th=[  124],
     | 99.00th=[  167], 99.50th=[  185], 99.90th=[  346], 99.95th=[  390],
     | 99.99th=[  446]
    bw (KB/s)  : min=18336, max=19408, per=12.50%, avg=18496.61, stdev=102.97
    lat (usec) : 50=0.11%, 100=35.29%, 250=64.39%, 500=0.20%, 750=0.01%
  cpu          : usr=2.13%, sys=4.51%, ctx=4194482, majf=0, minf=204
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=4194304/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=8192.0MB, aggrb=147915KB/s, minb=147915KB/s, maxb=147915KB/s, mint=56712msec, maxt=56712msec

Disk stats (read/write):
  hioa: ios=4192848/0, merge=0/0, ticks=418420/0, in_queue=419490, util=99.99%
02-08 13:59:02 1406955542